In [1]:
from pandas import Series
import pandas as pd
from pandas import DataFrame

import matplotlib
import matplotlib.pyplot as plt
%matplotlib inline

import seaborn as sns
sns.set_context("talk")
sns.set_style("white")

User data
==================

In [3]:
# pass in column names for each CSV
u_cols = ['user_id', 'age', 'sex', 'occupation', 'zip_code']

users = pd.read_csv(
    'http://files.grouplens.org/datasets/movielens/ml-100k/u.user', 
    sep='|', names=u_cols)

users.head()

   user_id  age sex  occupation zip_code
0        1   24   M  technician    85711
1        2   53   F       other    94043
2        3   23   M      writer    32067
3        4   24   M  technician    43537
4        5   33   F       other    15213

Ratings
============

In [4]:
r_cols = ['user_id', 'movie_id', 'rating', 'unix_timestamp']
ratings = pd.read_csv(
    'http://files.grouplens.org/datasets/movielens/ml-100k/u.data', 
    sep='\t', names=r_cols)

ratings.head()

   user_id  movie_id  rating  unix_timestamp
0      196       242       3       881250949
1      186       302       3       891717742
2       22       377       1       878887116
3      244        51       2       880606923
4      166       346       1       886397596

Movies
=========================

In [6]:
# the movies file contains columns indicating the movie's genres
# let's only load the first five columns of the file with usecols
m_cols = ['movie_id', 'title', 'release_date', 
            'video_release_date', 'imdb_url']

movies = pd.read_csv(
    'http://files.grouplens.org/datasets/movielens/ml-100k/u.item', 
    sep='|', names=m_cols, usecols=range(5), encoding='latin1')

movies.head()

,movie_id,title,release_date,video_release_date,imdb_url
0,1,Toy Story (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Toy%20Story%2...
1,2,GoldenEye (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?GoldenEye%20(...
2,3,Four Rooms (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Four%20Rooms%...
3,4,Get Shorty (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Get%20Shorty%...
4,5,Copycat (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Copycat%20(1995)

Obtenemos información sobre los datos
=======================

In [7]:
print (movies.dtypes)
print ()
print (movies.describe())
# *** Why only those two columns? ***

movie_id                int64
title                  object
release_date           object
video_release_date    float64
imdb_url               object
dtype: object

          movie_id  video_release_date
count  1682.000000                 0.0
mean    841.500000                 NaN
std     485.695893                 NaN
min       1.000000                 NaN
25%     421.250000                 NaN
50%     841.500000                 NaN
75%    1261.750000                 NaN
max    1682.000000                 NaN

Selección de datos
==============

* DataFrame => grupo de Series con un índice compartido
* Una columna de un DataFrame => Series

In [12]:
users.loc[users['occupation'] == 'technician']

     user_id  age sex  occupation zip_code
0          1   24   M  technician    85711
3          4   24   M  technician    43537
43        44   26   M  technician    46260
76        77   30   M  technician    29379
142      143   42   M  technician    08832
196      197   55   M  technician    75094
243      244   28   M  technician    80525
293      294   34   M  technician    92110
310      311   32   M  technician    73071
324      325   48   M  technician    02139
440      441   50   M  technician    55013
455      456   24   M  technician    31820
457      458   47   M  technician    Y1A6B
487      488   48   M  technician    21012
544      545   27   M  technician    08052
669      670   30   M  technician    21114
714      715   21   M  technician    91206
716      717   24   M  technician    84105
717      718   42   M  technician    64118
737      738   35   M  technician    95403
738      739   35   M  technician    73162
789      790   27   M  technician    80913
811      812   22   M  technician    76234
831      832   24   M  technician    77042
849      850   34   M  technician    78390
888      889   24   M  technician    78704
937      938   38   F  technician    55038

In [ ]:
users[]

In [20]:
columns_you_want = ['occupation', 'sex']
users[columns_you_want].head()

   occupation sex
0  technician   M
1       other   F
2      writer   M
3  technician   M
4       other   F

Filtering data
==============

Selecciona los users mayores que 25 años

In [26]:
oldUsers = users[users.age > 25]
print ("hello")
oldUsers.head()

hello

   user_id  age sex     occupation zip_code
1        2   53   F          other    94043
4        5   33   F          other    15213
5        6   42   M      executive    98101
6        7   57   M  administrator    91344
7        8   36   M  administrator    05201

Ejercicio:
=====

* Muestra los usarios de 40 años hombres

* Muestra la edad promedio de las programadores mujeres

In [9]:
# Muestra los usarios de 40 años hombres
# Escribe tu código aquí

In [27]:
## usuarios que son mujeres y programadoras
# Escribe tu código aquí

## Muestra el promedio de edad
# Escribe tu código aquí

Split-apply-combine
===================

* Divide la data en grupos basados en cierto criterio
* Aplica una función para cada grupo de manera independiente
* Combina lo resuldatos en una estructura de datos

Split-apply-combine
===================

<img src=http://i.imgur.com/yjNkiwL.png></img>

Encontrar buenos usuarios
===================

* Divide la data por user ID
* Cuenta ratings
* Combina resultado

In [73]:
print (ratings.head())
## split data
grouped_data = ratings.groupby('user_id') # Dataframes
#grouped_data = ratings['movie_id'].groupby(ratings['user_id']) # Series

## count and combine
ratings_per_user = grouped_data.count()

ratings_per_user.head(5)

   user_id  movie_id  rating  unix_timestamp
0      196       242       3       881250949
1      186       302       3       891717742
2       22       377       1       878887116
3      244        51       2       880606923
4      166       346       1       886397596

         movie_id  rating  unix_timestamp
user_id
1             272     272             272
2              62      62              62
3              54      54              54
4              24      24              24
5             175     175             175

In [74]:
type(grouped_data)

pandas.core.groupby.groupby.DataFrameGroupBy

In [75]:
rat = grouped_data.mean()['rating']

In [76]:
rat.sort_values(ascending=False).head(5)

user_id
849    4.869565
688    4.833333
507    4.724138
628    4.703704
928    4.687500
Name: rating, dtype: float64

In [68]:
type(grouped_data)

pandas.core.groupby.groupby.DataFrameGroupBy

Ejercicio
====

* Obtén el rating promedio de cada película
* Obtén las películas con el rating promedio más alto

In [12]:
## Split data
# Escribe tu código aquí

## Obtén promedio y combina
# Escribe tu código aquí

# Obtén el rating máximo
# Escribe tu código aquí

# Obtén los ids de películas con ese rating
# Escribe tu código aquí

In [41]:
# Obtén el número de ratings por película
# Tu código aquí

Lambdas
==================

In [77]:
def get_mean(f):
    return f.mean()

In [78]:
grouped_data = ratings.groupby('user_id')
average_ratings = grouped_data.apply(lambda f: f.mean())
average_ratings = grouped_data.apply(get_mean)
average_ratings.head()

         user_id    movie_id    rating  unix_timestamp
user_id
1            1.0  136.500000  3.610294    8.773916e+08
2            2.0  249.500000  3.709677    8.886204e+08
3            3.0  318.814815  2.796296    8.892372e+08
4            4.0  291.041667  4.333333    8.920028e+08
5            5.0  291.291429  2.874286    8.762081e+08

Ejercicio
====

* Obtén el rating promedio por usuario
* Lista todas las ocupaciones y si son dominadas por hombres o por mujeres.

'H' - Si son dominadas por hombres
'M' - Si son dominadas por mujeres

In [19]:
# Obtén el rating promedio por usuario
# Tu código aquí

In [80]:
users.head()

   user_id  age sex  occupation zip_code
0        1   24   M  technician    85711
1        2   53   F       other    94043
2        3   23   M      writer    32067
3        4   24   M  technician    43537
4        5   33   F       other    15213

In [87]:
# Lista todas las ocupaciones y si son dominadas por hombres o port mujeres.
# Tu código aquí
users.groupby('occupation').apply(lambda x: 'F' if x[x['sex']=='F']['user_id'].count() > x[x['sex']=='M']['user_id'].count() else 'M')

occupation
administrator    M
artist           M
doctor           M
educator         M
engineer         M
entertainment    M
executive        M
healthcare       F
homemaker        F
lawyer           M
librarian        F
marketing        M
none             M
other            M
programmer       M
retired          M
salesman         M
scientist        M
student          M
technician       M
writer           M
dtype: object